{"data":{"site":{"siteMetadata":{"blogAuthor":"Damien Senger","blogBio":"I’m a queer designer in Rotterdam specialised in web accessibility fighting every day for a more inclusive web."}},"markdownRemark":{"html":"<p>In May 2017, <a href=\"https://webkit.org/blog/7551/responsive-design-for-motion/\">WebKit started communicating about prefers-reduced-motion</a>, a new media query targeting users who activated the reduced motion mode on their device. The goal? To serve alternate animations that avoid triggering motion sickness for people with <a href=\"http://simplyaccessible.com/article/balance-awareness/\">vestibular disorders</a>.</p>\n<h2>Our interfaces can make people sick</h2>\n<p>This story starts with the release of iOS7 in 2013 presenting a brand new interface for iOS whose fundamentals are still in use today. Even if this new interface was a success, this release was followed by <a href=\"https://www.theguardian.com/technology/2013/sep/27/ios-7-motion-sickness-nausea\">important media coverage of people reporting motion sickness and vertigo</a> while using their device.</p>\n<p>For one of the first time, digital designers were confronted to the fact that yes, <strong>user interfaces can make people sick</strong>.</p>\n<p>Of course, it was not the first interface creating motion sickness. But iOS have a big number of users and Apple has made an effort to make their products accessible which put the spotlight on something often forgotten by web builders: <a href=\"https://a11yproject.com/posts/understanding-vestibular-disorders/\">vestibular disorders</a> and other cognitive impairments.</p>\n<p>Roughly speaking, vestibular disorders affect the users’ balance and their visual perception of the world around them. This is mainly due to a problem with their inner ear.</p>\n<h2>Who can benefit from motionless animations?</h2>\n<p>When browsing a website or using a web application, <strong>animations can have a significant impact on users’ experience</strong>. The motion sickness resulting from iOS’s new animations put the spotlight on the vestibular disorders spectrum but, it is not the only impairment affected by these animations. <strong>Reducing motion effects in animations can help most of the users with cognitive impairments.</strong></p>\n<p>For example, users with reduced attention span (ADHD people, some autistic folks, users recovering after a stroke, etc.) can also benefit from having alternative animations that have less impact on their cognitive load.</p>\n<p>Because <em>motion is wonderful except when it is not</em>, Apple included <a href=\"https://support.apple.com/en-gb/HT202655\">an option in the accessibility settings to allow users the ability to disable some native iOS animations</a> like parallax and app launching effects. In 2014, they also <a href=\"https://drafts.csswg.org/mediaqueries-5/#prefers-reduced-motion\">proposed a <em>reduced-motion</em> media query</a> to avoid creating discomfort to users suffering from motion sickness. Since 2017, heavy animations on their website are replaced by more accessible ones when this option is activated.</p>\n<p>Unfortunately, some conditions apply: to this date, this media query is <a href=\"https://caniuse.com/#feat=prefers-reduced-motion\">only supported by Safari, iOS Safari, Firefox and Chrome 74+</a>.</p>\n<h2>A solution too often misunderstood in its use</h2>\n<p>More and more, we can see designers and developers using the reduced-motion media query in their projects. Unfortunately, most of the time this media query is used to disable CSS animations rather than to offer an inclusive experience.</p>\n<blockquote>\n<p>Reduced motion ≠ No animation</p>\n</blockquote>\n<p>The idea behind this media query is to <strong>decrease the motion sickness of users</strong> experiencing vestibular disorders. Even if we are considering a wider range of impairments with attention-related issues, <strong>the idea was never to remove all animations of an interface</strong>.</p>\n<p><strong>Powerful animations help users to discover, navigate and understand an interface.</strong> Animations are often <strong>needed to offer good user experience</strong> and to avoid users’ cognitive overload with progressive disclosure of processes, content or actions. <strong>Removing all animations unconditionally for users with an active reduced-motion option will impact their experience.</strong></p>\n<h2>When should we use the reduced-motion media feature?</h2>\n<p>First of all, in the case of vestibular disorders, motion sickness is only triggered by really specific types of animations.</p>\n<p>To summarize, motion sickness is mainly triggered by <strong>scaling/zoom effects</strong>, especially when associated with a <strong>blur (dis)appearance</strong>, <strong>spinning or moving elements</strong> and <strong>parallax effects</strong>.</p>\n<p>To be more in sync with the usage of this accessibility option by users, we can also add <strong>constant animations</strong> without play/pause controls and <strong>animations requiring a large attention span</strong> or highly distracting.</p>\n<p>Let’s face it: this is clearly not the bigger part of the animations we design and build in our interfaces. So removing everything may be a solution, but not nearly the best one.</p>\n<h2>How to build motionless animations?</h2>","frontmatter":{"date":"Saturday 1 June 2019","path":"/blog/reduced-motion","title":"A story of reduced motion","tags":["accessibility","reduced motion","animations"]}},"authorAvatar":{"childImageSharp":{"fixed":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAUEBv/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAGjh05YspwmVyzmgf/EAB0QAAMAAAcAAAAAAAAAAAAAAAECAwAEEhMhMjP/2gAIAQEAAQUCqxScaPuYey6phkZc3IheK38X7//EABURAQEAAAAAAAAAAAAAAAAAAAEg/9oACAEDAQE/ASP/xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AR//xAAiEAACAAQGAwAAAAAAAAAAAAAAAQIDETEQEhMhQWFxobH/2gAIAQEABj8CbQqxZk/WGndvYb4RehM6jX0meBn/xAAaEAEAAwEBAQAAAAAAAAAAAAABABEhUUEx/9oACAEBAAE/ISDtJsP6SouFo3Cry4ozF9ltW+JCUOOMMdw0Z2f/2gAMAwEAAgADAAAAEPQvw//EABYRAQEBAAAAAAAAAAAAAAAAAAEgIf/aAAgBAwEBPxAGrH//xAAWEQEBAQAAAAAAAAAAAAAAAAABICH/2gAIAQIBAT8QVwj/xAAeEAEAAgIBBQAAAAAAAAAAAAABABEhMUFRYZGxwf/aAAgBAQABPxCkSsdocXKkYJLKeZRhGwA6asvyWN0qVmjq6gLlh9niOpr2iAIUwDFgYT//2Q==","width":160,"height":160,"src":"/static/26e35594fc179bb072791b428fb3e895/78aed/damien-avatar-400.jpg","srcSet":"/static/26e35594fc179bb072791b428fb3e895/78aed/damien-avatar-400.jpg 1x,\n/static/26e35594fc179bb072791b428fb3e895/d3b6d/damien-avatar-400.jpg 1.5x,\n/static/26e35594fc179bb072791b428fb3e895/f2412/damien-avatar-400.jpg 2x"}}}},"pageContext":{}}